# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\thetr\OneDrive\Documentos\PSoC Creator\LCD_I2C_PSoC5LP\LCD_I2C_PSoC4P.cydsn\LCD_I2C_PSoC4P.cyprj
# Date: Mon, 21 Dec 2015 16:21:46 GMT
#set_units -time ns
create_clock -name {I2C_SCBCLK(FFB)} -period 875 -waveform {0 437.5} [list [get_pins {ClockBlock/ff_div_3}]]
create_clock -name {CyRouted1} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {I2C_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 21 43} [list]


# Component constraints for C:\Users\thetr\OneDrive\Documentos\PSoC Creator\LCD_I2C_PSoC5LP\LCD_I2C_PSoC4P.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\thetr\OneDrive\Documentos\PSoC Creator\LCD_I2C_PSoC5LP\LCD_I2C_PSoC4P.cydsn\LCD_I2C_PSoC4P.cyprj
# Date: Mon, 21 Dec 2015 16:21:42 GMT
